Documents/ДосрочныйЗапускВПроизводство.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Document>
		<Properties>
			<Name>ДосрочныйЗапускВПроизводство</Name>
			<Posting>Deny</Posting>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Автор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ЗадачиРКД</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ЗадачаРКД</Name>
							<Type>
								<v8:Type>cfg:TaskRef.Задачи_РКД</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

Documents/ДосрочныйЗапускВПроизводство/Ext/ObjectModule.bsl
Процедура ПриЗаписи(Отказ)  
	
	УИДДоски 	= омКанбанДоскиНаСервереПовтор.ПолучитьУИДДоски("НаименованиеДоскиПроизводство");
	
	Для каждого ТекущаяЗадача Из ЗадачиРКД Цикл
	
		омЗадачиРКДНаСервере.ЗавершениеЗадачиРКД(ТекущаяЗадача.ЗадачаРКД);
		
		Если НЕ ПустаяСтрока(Комментарий) Тогда
			
			УИДКарточка = омКанбанДоскиНаСервере.ПолучитьУИДКарточки(УИДДоски, ТекущаяЗадача.ЗадачаРКД.ОбъектТЗ);
			Если НЕ ПустаяСтрока(УИДКарточка)  Тогда
				омКанбанТЗ.СоздатьКомментарий(УИДКарточка, Комментарий);	
			КонецЕсли;
			
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры
